# Задача №3
def ui_arithmetic_conversion():
    """
    Функция реализующая пользовательский интерфейс в консоли для решения следующей задачи:
    Требуется проверить можно ли получить число из 3-го массива, арифметическими преобразованиями
    с числами двух других массивов. Числа проверяются последовательно.
    """
    pass


def arithmetic_conversion():
    """
    Функция реализующая решение следующей задачи:
    Требуется проверить можно ли получить число из 3-го массива, арифметическими преобразованиями
    с числами двух других массивов. Числа проверяются последовательно.
    """
    pass


def check_arithmetic_operation():
    """
    Функция реализующая проверку: можно ли получить число из 3-го массива, заданным арифметическим преобразованием
    с числами 2-ух других массивов. В случае положительного результата добавляет полученый способ в список результатов.
    """
    pass