def input_correct_num():
    """
    Функция реализующая ввод пользователем корректного числа входящего в заданный диапазон.
    """
    pass


def ui_array_init(array):
    """
    Функция для инициализации массива числами вручную.
    :param array: Массив для инициализации.
    """
    pass


def auto_array_init(array):
    """
    Функция для инициализации массива случайными числами.
    :param array: Массив для инициализации.
    """
    pass


def ui_array_of_dots_init():
    """
    Функция реализующая пользовательский интерфейс в консоли для инициализации массива точек вручную.
    """
    pass


def ui_auto_array_of_dots_init():
    """
    Функция реализующая пользовательский интерфейс в консоли для инициализации массива случайными точками.
    """
    pass